//В C# не используеться такое определение как модуль, в отличии от Python и других языках, только классы,простанства имен.
//В С# используються подключаемые библиотеки, которые содержат нужные классы.
//Определение Модуля как в Python, в с# больше похож на статический класс, например Math.
//Чтобы его использовать нужно подключить простраснство имен using System.
//Создавть экземпляр класса не нужно, просто используете методы в статическом классе, например Math.random().
//Статические классы в С# не поддерживают наследование, поэтому Концепцию "класс как модуль" в С#, можно реализовать лишь через абстрактные классы.

// Класс(модуль) MarineVessel автономен и уверсален, может использоваться как самостоятельный элемен - класс Boot
// Класс(модуль) Sailboat использует родительский модуль и расширяет его дополнительными возможностями.
abstract class MarineVessel
{
    public MarineVessel()
    {

    }
    public void Drifting()
    {
        Console.WriteLine("Дрейвовать");
    }
}
abstract class Boot :MarineVessel
{

}
abstract class Sailboat : MarineVessel
{
    public void Sail()
    {
        Console.WriteLine("Плавать под парусом");
    }
}
